tags/1_0_42/adit-war/doc/testMessages/sendDocument.v1/sendDocument.v1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xtee="http://x-tee.riik.ee/xsd/xtee.xsd" xmlns:adit="http://producers.ametlikud-dokumendid.xtee.riik.ee/producer/ametlikud-dokumendid">
   <soapenv:Header>
     <xtee:nimi>ametlikud-dokumendid.sendDocument.v1</xtee:nimi>
      <xtee:id>00000000000000</xtee:id>
      <xtee:isikukood>EE38407054916</xtee:isikukood>
      <xtee:andmekogu>ametlikud-dokumendid</xtee:andmekogu>
      <xtee:asutus>12345678</xtee:asutus>
      <adit:infosysteem>KOV</adit:infosysteem>
   </soapenv:Header>
   <soapenv:Body>
      <adit:SendDocument>
         <keha>
            <adit:document_id>2</adit:document_id>
            <adit:recipient_list>
               <adit:code>EE38407089745</adit:code>
            </adit:recipient_list>
         </keha>
      </adit:SendDocument>
   </soapenv:Body>
</soapenv:Envelope>